# Generic Zone Get Space Ids Method

Source: https://www.revitapidocs.com/2026/c499ea28-9404-d818-f29c-63225a1f99e5.htm

---

| Generic Zone Get Space Ids Method |
| --- |

Gets a list of ElementIds of the associated spaces for the zone.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ISet<ElementId> GetSpaceIds()
```

```
Public Function GetSpaceIds As ISet(Of ElementId)
```

```
public:
ISet<ElementId^>^ GetSpaceIds()
```

```
member GetSpaceIds : unit -> ISet<ElementId>
```

#### Return Value

ISet ElementId
The associated spaces for the space\-based zone. Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This generic zone must be space\-based. |

See Also

#### Reference

GenericZone Class Autodesk.Revit.DB.Analysis Namespace